[
    {
        "id": "1",
        "name": "偷天换日",
        "details": "每局一次，别家出牌后若无人鸣牌，将这张牌与一张手牌互换。（可更换立直宣言牌，可导致别家振听，若此牌放铳则视为你放铳）。"
    },
    {
        "id": "2",
        "name": "南蛮入侵",
        "details": "每局一次，打出一张非字牌后，让所有人选择跟打同样数字或同样花色的牌。如果都没有则需要给你1300点（不会对立直家产生影响）。"
    },
    {
        "id": "3",
        "name": "万箭齐发",
        "details": "每局一次，配牌结束时宣言所有人胡牌时必须带有某一个数字与某一个花色，否则胡牌时支付你3000点。"
    },
    {
	"id": "4",
	"name": "过河拆桥",
	"details": "每次碰别家的牌时，都可以从这家收取1000点，每次杠别家的牌时，都可以从这家收取1500点，每次暗杠时收取各家1000点，加杠各收500点。"
    },
    {
	"id": "5",
	"name": "重铸",
	"details": "非门风和场风的风牌可以拔（正向补牌，不算作宝牌），且每拔3张你本次胡牌多一番。"
    },
    {
	"id": "6",
	"name": "金钟罩",
	"details": "每局一次，打出牌河第8张时，可以掷一个骰子，若掷出奇数，拿1500点，本局游戏你的点数不会再改变。（即胡牌不会增加点数，放铳不会减少点数）"
    },
    {
	"id": "7",
	"name": "铁布衫",
	"details": "别家荣胡时，你手里每有一张是他的铳牌，便可少付1000点。别家自摸时，你每有一张他的铳牌，可少支付500点。如果你流局未听，则手中每有一张是别家铳牌，便从那里收取1000点（流局听牌正常结算）。"
    },
    {
	"id": "8",
	"name": "无巧不成杠",
	"details": "用三张相同的牌与另一张不同的牌即可杠。当你手中有或别家打出第四张时，你可以将补杠的那张牌翻面，视作完成一杠。你胡牌时，每个未完成的杠会使你减一番（至多减到1番），符数正常计算 ，流局时未完成的杠不会使你未听。（别家抢杠时，抢的是你的补杠牌，而不是原本代表的牌）。"
    },
    {
	"id": "9",
	"name": "时空之门",
	"details": "每局两次，用你的一张手牌换回你牌河中的一张牌，你不能通过这种方式自摸。你的振听自摸算作倍满，不需有役。（同巡振听除外）"
    },
    {
	"id": "10",
	"name": "急急国王",
	"details": "你副露永远优先，每局你可以吃任意一家的牌两次，你最多只能3副露，你副露情况下断幺额外加一番。"
    },
    {
	"id": "11",
	"name": "一圈通贯",
	"details": "1与9连续。（如912组成顺子）（可视作平胡）。"
    },
    {
	"id": "12",
	"name": "真视之眼",
	"details": "每局一次，一次性观看任意7张牌。（包括王牌，其余三家的牌）。"
    },
    {
	"id": "13",
	"name": "颠倒黑白",
	"details": "你的一番牌型均为两番（一发除外），两番牌型均为一番，附减牌型改为附加（三色，一气，混全，纯全，混，清）。但流局时，你需向听牌各家额外支付1000点罚符。"
    },
    {
	"id": "14",
	"name": "开拓者",
	"details": "每当有人（包括自己）打出宝牌时，你可以选择多开一张指示牌，或扣掉一张指示牌（可使当局dora变为0），或让所有指示牌改为指向其上一张。当本局游戏指示牌显露3张时，你胡牌额外加一番。"
    },
    {
	"id": "15",
	"name": "天际飞行员",
	"details": "每局你需要支付5000场贡，当你被击飞时，从别家各拿12000点继续游戏。若你是因支付不起场贡而被飞，则需要在从别家拿取点数后在下一局补满未支付的场贡。（只生效1次，且生效后失去超能力变为白板）。"
    },
    {
	"id": "16",
	"name": "万华镜",
	"details": "配牌结束时，你可以选择一个花色的万能牌（梅兰竹菊对应万筒索字），将其作为第一巡的进张。当你立直时，需要宣布你的万能牌代替的数字。"
    },
    {
	"id": "17",
	"name": "预言家",
	"details": "摸牌时，若牌河中没有扣置的牌，可以摸一到五张牌查看并重组手牌，并将等量的牌扣放在牌河中。否则，将切牌改为翻开第一张暗牌。（牌河中有暗牌时，不可立直，但有役可以荣胡，且结算胡牌时，同时把所有暗置的牌翻面结算振听。摸牌时，需保证摸牌数目和自己所剩的巡目匹配，如：自己只剩4巡摸牌机会，则该次摸牌只可最多摸4张）。"
    },
    {
	"id": "18",
	"name": "常立常新",
	"details": "你立直后的每一回合都可再次立直，但立直费用每次增加300点，自第二次立直开始失去役“一发”。（每次立直都可多加一番）。"
    },
    {
	"id": "19",
	"name": "潘多拉的魔盒",
	"details": "每回合一次，从除去该技能外的11种技能中抽取一个作为你的技能，或维持上一局的技能不变（维持效果最多持续一局）。"
    },
    {
	"id": "20",
	"name": "无中生友",
	"details": "胡牌时，可以从点棒盒也收取一份点棒，点数为2倍基本点。支付点数时，可以从点棒盒拿取一部分支付，点数为1倍基本点。（基本点：点数计算时4a中的1a，如8000的胡牌，1a为2000点）。"
    },
    {
	"id": "21",
	"name": "决斗之王",
	"details": "每局一次，选择一个人与之掷两个骰子拼点，若赢3点及以上，则本局加2番并额外进行1个回合（多进行一巡），3点以下则本局加1番，平则无事发生，输则对方加1番。"
    },
    {
	"id": "22",
	"name": "波光粼粼",
	"details": "你打出过的宝牌也算做你的宝牌（包括里宝）。"
    },
    {
	"id": "23",
	"name": "大大大相公",
	"details": "配牌结束后多摸三张牌，切牌时可以多切一张牌。其他家副露及荣胡时，只允许副露和荣胡你后切出的手牌。"
    },
    {
	"id": "24",
	"name": "有借有还",
	"details": "每局一次，配牌结束时，若你是闲家，则庄家给你2张牌，其余两家给你1张牌，之后你如数还出。若你是庄家，则每家给你1张牌，之后如数还出。"
    },
    {
	"id": "25",
	"name": "解忧杂货铺",
	"details": "每圈兜售四种道具！\n（1）可以暗牌打出一张牌的保护罩：1000点，4个\n（2）可以换回前三巡出牌的时光机：1000点，3个\n（3）可以给立直加1番的ex咖喱棒：1500点，2个\n（4）可以获得神秘指示牌的魔法书：1500点，3个（配牌结束后，将王牌前最后一张牌作为本局游戏的神秘牌，并且明示。神秘指示牌本身算作宝牌。） \n无论是谁购买，都将点棒计入解忧杂货铺的盈利。每局游戏结束时，你和赢家平分杂货铺中的盈利（你多赢家少），若流局则你拿走所有盈利。\n在东三局0本场时，若你的前三种道具仍有存量，则可以自己使用它们（不可使用第四种），且一回合最多使用两次。当你自身的使用和其他家冲突时，以其他家的购买为优先。"
    },
    {
	"id": "26",
	"name": "读心术",
	"details": "每局一次，在任意时刻，猜测另一家的听牌2次：（最多猜3种）\n（1）若全部猜对，视为放铳此牌并由对面支付给你（无岭上，海底，一发），本局结束；\n（2）若猜对其中一部分，对方需要支付你2000点，牌局继续；\n（3）若未猜对，则牌局继续，且若最后这家荣胡，你包一半。（自摸正常结算，不包牌）。"
    },
    {
	"id": "27",
	"name": "玲珑宝骰",
	"details": "每局两次，在你的回合掷一颗骰子：\n（1）切牌后再次进行一回合；\n（2）暗牌打出一张牌；\n（3）本局加1番；\n（4）本局你多一张里宝指示牌；\n（5）将一张你的手牌与指示牌调换；\n（6）无特殊效果，但可支付1000点场贡再掷一次。"
    },
    {
	"id": "28",
	"name": "吸金磁",
	"details": "无论何时，所有立直棒与场贡全部归你所有。拥有此技能时，每个本场变为600而不是300。"
    },
    {
	"id": "29",
	"name": "花开不败",
	"details": "随时查看所有岭上牌，未立直状态下，在你听牌时，你随时可以摸岭上牌达成岭上开花，但必须遵从岭上顺序摸牌。你的岭上开花加1番。每局一次，你可用一张手牌交换岭上牌。"
    },
    {
	"id": "30",
	"name": "九牌大师",
	"details": "有人胡牌时，若你达成了流局满贯的条件，就此结算流局满贯。"
    },
    {
	"id": "31",
	"name": "千鸟码牌法",
	"details": "每圈一次，在一局结束后，从场上挑四张牌加入自己下一局的配牌。下一局配牌时，正常抓取，之后选择4张牌放回牌山，位置自选。"
    },
    {
	"id": "32",
	"name": "绝命一搏",
	"details": "每个半庄限一次，牌局结束时发动，倘若你此刻是四位或三位，这局之前的每两局（向下取整），都会使你在接下来多进行一局，每一局中多一番，并在立直和流局时多支付1000点场贡，同时你需要配牌明牌，不能连庄。"
    },
    {
	"id": "33",
	"name": "大检察官",
	"details": "每局一次，有人切出三张相同的牌时，若无人副露这张牌且你未立直，你可以严厉地质问他为何如此做，并从手牌挑出三张替换掉这三张牌。每局一次，若有人连续切出两张相同牌时，你可以从手牌挑出一张和这张牌交换。"
    },
    {
	"id": "34",
	"name": "四喜临门",
	"details": "所有人牌河的第一张牌都视作你的宝牌指示牌。 "
    },
    {
	"id": "35",
	"name": "小心有诈",
	"details": "你未听也可立直，立直后仍然可以手切，不可以双立直，不算诈立。若你副露，收回你的立直棒（如果还在的话）。"
    },
    {
	"id": "36",
	"name": "关灯",
	"details": "每圈两次，在配牌结束后，你可以选择任意一侧的山牌，将山牌前1-13张与自己的手牌更换，并将等量的牌以任意顺序放回牌山前。"
    },
    {
	"id": "37",
	"name": "勇冠三军",
	"details": "每局配牌结束时发动，每圈一次，别家四番缚，且若流局，不结算流局罚符，其他家的手役最高目每离四番差一番，便要支付给你1000点（未听算0番）。*"
    },
    {
	"id": "38",
	"name": "血战到底",
	"details": "别家胡牌时，选择结束本局，或暂不结算并按照血战到底规则继续游戏。"
    },
    {
	"id": "39",
	"name": "写轮眼",
	"details": "每圈一次，在某单局时，可支付1000点场贡，复制一个别家的技能使用。可再支付1500/2000点，复制其他家的技能。倘若你如此做，本局游戏可获得三家的全部能力。本局之后，在这一圈中，从多种能力中选择一种作为本圈的持续能力。若你的技能与别家技能同时发动，你总视为后手。"
    },
    {
	"id": "40",
	"name": "藏宝阁",
	"details": "你牌河第二行开始时，不论手牌组成如何，若门清摸牌后若有3张宝牌即可立直（听牌为场上所有宝牌），若有4张宝牌即可宣布自摸胡牌，亦可dama荣和别家打出的宝牌。非胡牌型不计手役，不计诈立，符数为25。"
    },
    {
	"id": "41",
	"name": "久帝之势",
	"details": "当你听牌时的形状为恶型时，你胡牌后的番数加一番。（恶型：听牌总枚数小于4。如坎张，边张，单骑，对碰）当你追立他人时，可多翻一张宝牌（下一枚表宝）。"
    },
    {
	"id": "42",
	"name": "光明正大",
	"details": "配牌之后，你可以展示自己的5张手牌，如果其他人的手牌中拥有你所展示的牌，则也需摊开放置在面前。每个巡目开始时，你可以选择主动展示一张自己的手牌（其他人无需继续展示），当你的手牌全部明牌时，你自摸后的番数多2番，且无论牌型，其他三家对你的放铳视为倍满。"
    },
    {
	"id": "43",
	"name": "暗夜之王",
	"details": "从第五巡开始，你可以将你所有之后的舍牌全部暗置，但若如此做，你变为三番缚，且不会结算流局满贯。"
    },
    {
	"id": "44",
	"name": "书法爱好者",
	"details": "你的中发白可作为顺子组成一个面子，你的东南西北按顺序排列也可组成一个顺子面子（如东南西，南西北，北东南），你集齐东南西北之后可以开明/暗杠，符数按照幺九字牌结算。你的字牌顺子可算作平胡。"
    },
    {
	"id": "45",
	"name": "淘金者",
	"details": "其余三家的宝牌需要公开展示。当其余三家有人打出宝牌时，你可以选择一张手牌与之替换（可造成振听）"
    },
    {
	"id": "46",
	"name": "神之一手",
	"details": "你可选择每场开局的起始宝牌数目（1-5）。在其他人立直时，你可以选择用自己的一张手牌替换该牌。在流局结算听牌时，你翻开所有的里宝指示牌，若表宝和里宝中有你的听牌则视为海底自摸。"
    },
    {
	"id": "47",
	"name": "厚积薄发",
	"details": "在每局回合开始时，你可以将一张牌扣置在你面前且不会被重新洗牌，在东四0本场和南四0本场时，将你所有扣置的牌与自己的手牌中任意数目的牌互换，之后将其余牌加入摸牌堆顶部。"
    },
    {
	"id": "48",
	"name": "背水一战",
	"details": "在你立直时，若此巡之内有任意家鸣牌，可支付1000点场贡使其鸣牌失效（可多次使用），若本巡没有被鸣牌，使自己下回合摸3张牌，若能成功自摸，则视作一发，若不能成功自摸，则跳过三回合不摸牌。"
    },
    {
	"id": "49",
	"name": "百面玲珑",
	"details": "在每场对局开始时，所有玩家要从“万，饼，索”中选择一种，作为本局游戏的派系。若你放铳给相同派系的人，使之胡牌-1番。若不同派系的人放铳给你，则你的胡牌+1番。你在每一巡摸牌时可随时更改自己的派系（其他玩家不可更改）。若你荣胡或自摸与派系所属相同的牌，则额外+20符。若其他家荣胡或自摸与自己派系相同的牌，则额外＋10符。"
    }
]
